docs/comp-sci/sml/type-theory.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Type Theory of SML</title>
<meta name="author" content="Alex Nelson" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
\)</div>
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Type Theory of SML</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#h-07afd94f-ca63-4a36-8c04-9dbe20f18872">1. Overview</a></li>
<li><a href="#h-56474fb9-30f9-42d5-b52a-f02846a54af9">2. Values and Value Restriction</a></li>
<li><a href="#h-244680bc-e10d-4998-a7d2-4831cbd142b6">3. Polymorphism</a></li>
<li><a href="#h-7e32734c-7e9c-46b7-a9f1-e87d33219ef2">4. References</a></li>
</ul>
</div>
</div>

<div id="outline-container-h-07afd94f-ca63-4a36-8c04-9dbe20f18872" class="outline-2">
<h2 id="h-07afd94f-ca63-4a36-8c04-9dbe20f18872"><span class="section-number-2">1.</span> Overview</h2>
<div class="outline-text-2" id="text-h-07afd94f-ca63-4a36-8c04-9dbe20f18872">
<p>
Standard ML appears to be prenex polymorphic typed-lambda calculus, but
it is a Hindley-Milner system. But I'm skeptical whether this is a good
intuition, since it seems algebraic data types match initial algebras
for endofunctors.
</p>

<p>
I'm going to have to examine the definition in greater detail, but I do
not know what the type theoretic structure of a <code>datatype</code> (algebraic
data type) is, exactly. I suspect it is a iso-recursive variant type, if
I may borrow the terminology of TAPL.
</p>
</div>
</div>

<div id="outline-container-h-56474fb9-30f9-42d5-b52a-f02846a54af9" class="outline-2">
<h2 id="h-56474fb9-30f9-42d5-b52a-f02846a54af9"><span class="section-number-2">2.</span> Values and Value Restriction</h2>
<div class="outline-text-2" id="text-h-56474fb9-30f9-42d5-b52a-f02846a54af9">
<p>
If we allow <i>anything</i> to appear in a reference type, then we can
quickly run into problems when storing a function in a
reference. Because of this, Standard ML restricts what values may be
stored in a reference type. The 1997 definition calls them
<dfn>Non-Expansive Expressions</dfn> and defines the in chapter 4
section 7.
</p>

<p>
<b>These are precisely "values", in the sense of <i>TAPL</i>.</b>
</p>

<p>
After desugaring an expression and performing the expansions defined in
the parsing step, the grammar for them in quasi-EBNF:
</p>

<pre class="example" id="orgff93153">
nexp = scon              ; special constants = literal values
     | ["op"] longvid    ; identifiers
     | "{" [nexprow] "}" ; record types
     | "(" nexp ")"
     | conexp nexp       ; constructors applied to nexp
     | nexp ":" ty
     | "fn" match        ; anonymous functions

nexprow = lab "=" nexp ["," nexprow]

conexp = "(" conexp [":" ty] ")"
       | ["op"] longvid
</pre>

<p>
The only constraints here are that within a <code>conexp</code> we require
<code>longvid</code> is not <code>ref</code>, and <code>is</code> of \(C(longvid)\in\{\mathtt{c},\mathtt{e}\}\).
</p>

<p>
We should actually think of "non-expansive expressions" as "syntactic
values". (If we compare them to semantic values found in chapter 6, then
we're actually pretty close.)
</p>

<p>
Observe that <code>ref NONE</code> is not a non-expansive expression because we could
do terrible things, like:
</p>

<div class="org-src-container">
<pre class="src src-sml"><span class="org-keyword">val</span> <span class="org-variable-name">r</span>: 'a option ref = ref NONE
<span class="org-keyword">val</span> <span class="org-variable-name">r1</span>: string option ref = r
<span class="org-keyword">val</span> <span class="org-variable-name">r2</span>: int option ref = r
<span class="org-keyword">val</span> () = r1 := SOME <span class="org-string">"foo"</span>
<span class="org-keyword">val</span> <span class="org-variable-name">v</span>: int = valOf (!r2)
</pre>
</div>

<p>
Also observe:
</p>

<ul class="org-ul">
<li>Function applications are expansive expressions</li>
<li>Let-expressions are expansive expressions</li>
<li>Raising or handling exceptions are expansive expressions</li>
<li>Conditionals and case-expressions are expansive expressions</li>
</ul>

<p>
Really, any expressions which can be evaluated further can create new
reference cells or raise exceptions, which are expansive (in the sense
that they <i>expand</i> memory usage).
</p>
</div>
</div>

<div id="outline-container-h-244680bc-e10d-4998-a7d2-4831cbd142b6" class="outline-2">
<h2 id="h-244680bc-e10d-4998-a7d2-4831cbd142b6"><span class="section-number-2">3.</span> Polymorphism</h2>
<div class="outline-text-2" id="text-h-244680bc-e10d-4998-a7d2-4831cbd142b6">
<p>
The notion of the "closure" operation when elaborating an expression
(the Clos operation defined in section 4.8) occurs in rule (15) of the
definition of Standard ML and is responsible for transforming an
expression into a polymorphic expression. This "Clos" operation enforces
value restriction by preventing a declaration binding an identifier to
an expansive expression from becoming polymorphic.
</p>

<p>
The comment to rule (15) is also worth pondering.
</p>
</div>
</div>

<div id="outline-container-h-7e32734c-7e9c-46b7-a9f1-e87d33219ef2" class="outline-2">
<h2 id="h-7e32734c-7e9c-46b7-a9f1-e87d33219ef2"><span class="section-number-2">4.</span> References</h2>
<div class="outline-text-2" id="text-h-7e32734c-7e9c-46b7-a9f1-e87d33219ef2">
<ul class="org-ul">
<li><a href="https://www.smlnj.org/doc/Conversion/types.html">Types and Type Checking</a> SMLNJ documentation</li>
<li>MLton documentation has a lot of gems
<ul class="org-ul">
<li><a href="http://mlton.org/ValueRestriction">Value Restriction</a></li>
<li><a href="http://mlton.org/Monomorphise">Monomorphise</a> seems to support the intuition of
initial algebra semantics for algebraic data types</li>
<li><a href="http://mlton.org/FirstClassPolymorphism">First-Class Polymorphism</a> doesn't exist in Standard ML (alas)</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated 2023-02-27 Mon 07:43.</p>
</div>
</body>
</html>